99_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "name", "sex", "color", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "strong, 100, hungry, desperate,"], ["updated_at", "2021-05-27 20:56:33.927381"], ["id", 1]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)